#### Terraform Plan (staging) 📖`success`

<details><summary>Show Plan (staging)</summary>

```

terraform
[0m[1mdata.terraform_remote_state.foundation: Reading...[0m[0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1maws_iam_openid_connect_provider.eks: Refreshing state... [id=arn:aws:iam::677282655012:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9][0m
[0m[1maws_eks_addon.aws_ebs_csi_driver: Refreshing state... [id=astro-data-pipeline-staging-eks:aws-ebs-csi-driver][0m
[0m[1maws_iam_role.eks_cluster: Refreshing state... [id=astro-data-pipeline-staging-eks-cluster-role][0m
[0m[1maws_iam_role.ebs_csi_driver: Refreshing state... [id=astro-data-pipeline-ebs-csi-driver-role][0m
[0m[1maws_iam_policy.eks_s3_access: Refreshing state... [id=arn:aws:iam::677282655012:policy/astro-data-pipeline-staging-eks-s3-access][0m
[0m[1maws_iam_role.eks_nodes: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role][0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=us-east-1][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=677282655012][0m
[0m[1maws_cloudwatch_log_group.eks_cluster: Refreshing state... [id=/aws/eks/astro-data-pipeline-staging-eks/cluster][0m
[0m[1mdata.terraform_remote_state.foundation: Read complete after 0s[0m
[0m[1maws_iam_role_policy_attachment.eks_s3_access: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role-20251003214716894500000001][0m
[0m[1maws_iam_role_policy_attachment.eks_worker_node_policy: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role-20251003214716971600000006][0m
[0m[1maws_iam_role_policy_attachment.eks_cni_policy: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role-20251003214716922200000003][0m
[0m[1maws_iam_role_policy_attachment.eks_container_registry_policy: Refreshing state... [id=astro-data-pipeline-staging-eks-nodes-role-20251003214716915000000002][0m
[0m[1maws_iam_role_policy_attachment.eks_vpc_resource_controller: Refreshing state... [id=astro-data-pipeline-staging-eks-cluster-role-20251003214716938200000005][0m
[0m[1maws_iam_role_policy_attachment.eks_cluster_policy: Refreshing state... [id=astro-data-pipeline-staging-eks-cluster-role-20251003214716933600000004][0m
[0m[1maws_eks_cluster.main: Refreshing state... [id=astro-data-pipeline-staging-eks][0m
[0m[1maws_eks_addon.kube_proxy: Refreshing state... [id=astro-data-pipeline-staging-eks:kube-proxy][0m
[0m[1maws_eks_addon.vpc_cni: Refreshing state... [id=astro-data-pipeline-staging-eks:vpc-cni][0m
[0m[1maws_eks_node_group.main["general"]: Refreshing state... [id=astro-data-pipeline-staging-eks:astro-data-pipeline-staging-general][0m
[0m[1maws_eks_addon.coredns: Refreshing state... [id=astro-data-pipeline-staging-eks:coredns][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # data.aws_eks_addon_version.coredns[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "coredns" {
      [32m+[0m[0m addon_name         = "coredns"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.30"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.kube_proxy[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "kube_proxy" {
      [32m+[0m[0m addon_name         = "kube-proxy"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.30"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # data.aws_eks_addon_version.vpc_cni[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "vpc_cni" {
      [32m+[0m[0m addon_name         = "vpc-cni"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.30"
      [32m+[0m[0m most_recent        = true
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # aws_eks_addon.aws_ebs_csi_driver[0m will be [1m[31mdestroyed[0m
  # (because aws_eks_addon.aws_ebs_csi_driver is not in configuration)
[0m  [31m-[0m[0m resource "aws_eks_addon" "aws_ebs_csi_driver" {
      [31m-[0m[0m addon_name                  = "aws-ebs-csi-driver" [90m-> null[0m[0m
      [31m-[0m[0m addon_version               = "v1.49.0-eksbuild.1" [90m-> null[0m[0m
      [31m-[0m[0m arn                         = "arn:aws:eks:us-east-1:677282655012:addon/astro-data-pipeline-staging-eks/aws-ebs-csi-driver/26ccd661-13a1-3fdf-d793-b179ac2dd59c" [90m-> null[0m[0m
      [31m-[0m[0m cluster_name                = "astro-data-pipeline-staging-eks" [90m-> null[0m[0m
      [31m-[0m[0m created_at                  = "2025-10-04T01:07:09Z" [90m-> null[0m[0m
      [31m-[0m[0m id                          = "astro-data-pipeline-staging-eks:aws-ebs-csi-driver" [90m-> null[0m[0m
      [31m-[0m[0m modified_at                 = "2025-10-04T02:14:18Z" [90m-> null[0m[0m
      [31m-[0m[0m resolve_conflicts_on_create = "OVERWRITE" [90m-> null[0m[0m
      [31m-[0m[0m service_account_role_arn    = "arn:aws:iam::677282655012:role/astro-data-pipeline-ebs-csi-driver-role" [90m-> null[0m[0m
      [31m-[0m[0m tags                        = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all                    = {
          [31m-[0m[0m "Environment"        = "staging"
          [31m-[0m[0m "Layer"              = "04-compute"
          [31m-[0m[0m "ManagedBy"          = "terraform"
          [31m-[0m[0m "Owner"              = "pmcgee"
          [31m-[0m[0m "Project"            = "astro-data-pipeline"
          [31m-[0m[0m "TerraformWorkspace" = "staging"
          [31m-[0m[0m "Version"            = "0.1"
        } [90m-> null[0m[0m
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

[1m  # aws_eks_addon.coredns[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_addon" "coredns" {
      [33m~[0m[0m addon_version               = "v1.10.1-eksbuild.38" -> (known after apply)
        id                          = "astro-data-pipeline-staging-eks:coredns"
        tags                        = {}
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_eks_addon.kube_proxy[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_addon" "kube_proxy" {
      [33m~[0m[0m addon_version               = "v1.28.15-eksbuild.31" -> (known after apply)
        id                          = "astro-data-pipeline-staging-eks:kube-proxy"
        tags                        = {}
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_eks_addon.vpc_cni[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_addon" "vpc_cni" {
      [33m~[0m[0m addon_version               = "v1.20.3-eksbuild.1" -> (known after apply)
        id                          = "astro-data-pipeline-staging-eks:vpc-cni"
        tags                        = {}
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_eks_cluster.main[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_cluster" "main" {
        id                            = "astro-data-pipeline-staging-eks"
        name                          = "astro-data-pipeline-staging-eks"
        tags                          = {
            "Name" = "astro-data-pipeline-staging-eks-cluster"
        }
      [33m~[0m[0m version                       = "1.28" [33m->[0m[0m "1.30"
        [90m# (11 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_iam_openid_connect_provider.eks[0m will be [1m[31mdestroyed[0m
  # (because aws_iam_openid_connect_provider.eks is not in configuration)
[0m  [31m-[0m[0m resource "aws_iam_openid_connect_provider" "eks" {
      [31m-[0m[0m arn             = "arn:aws:iam::677282655012:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9" [90m-> null[0m[0m
      [31m-[0m[0m client_id_list  = [
          [31m-[0m[0m "sts.amazonaws.com",
        ] [90m-> null[0m[0m
      [31m-[0m[0m id              = "arn:aws:iam::677282655012:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9" [90m-> null[0m[0m
      [31m-[0m[0m tags            = {
          [31m-[0m[0m "Name" = "astro-data-pipeline-staging-eks-oidc"
        } [90m-> null[0m[0m
      [31m-[0m[0m tags_all        = {
          [31m-[0m[0m "Environment"        = "staging"
          [31m-[0m[0m "Layer"              = "04-compute"
          [31m-[0m[0m "ManagedBy"          = "terraform"
          [31m-[0m[0m "Name"               = "astro-data-pipeline-staging-eks-oidc"
          [31m-[0m[0m "Owner"              = "pmcgee"
          [31m-[0m[0m "Project"            = "astro-data-pipeline"
          [31m-[0m[0m "TerraformWorkspace" = "staging"
          [31m-[0m[0m "Version"            = "0.1"
        } [90m-> null[0m[0m
      [31m-[0m[0m thumbprint_list = [
          [31m-[0m[0m "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] [90m-> null[0m[0m
      [31m-[0m[0m url             = "oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9" [90m-> null[0m[0m
    }

[1m  # aws_iam_role.ebs_csi_driver[0m will be [1m[31mdestroyed[0m
  # (because aws_iam_role.ebs_csi_driver is not in configuration)
[0m  [31m-[0m[0m resource "aws_iam_role" "ebs_csi_driver" {
      [31m-[0m[0m arn                   = "arn:aws:iam::677282655012:role/astro-data-pipeline-ebs-csi-driver-role" [90m-> null[0m[0m
      [31m-[0m[0m assume_role_policy    = jsonencode(
            {
              [31m-[0m[0m Statement = [
                  [31m-[0m[0m {
                      [31m-[0m[0m Action    = "sts:AssumeRoleWithWebIdentity"
                      [31m-[0m[0m Condition = {
                          [31m-[0m[0m StringEquals = {
                              [31m-[0m[0m "oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9:aud" = "sts.amazonaws.com"
                              [31m-[0m[0m "oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      [31m-[0m[0m Effect    = "Allow"
                      [31m-[0m[0m Principal = {
                          [31m-[0m[0m Federated = "arn:aws:iam::677282655012:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9"
                        }
                    },
                ]
              [31m-[0m[0m Version   = "2012-10-17"
            }
        ) [90m-> null[0m[0m
      [31m-[0m[0m create_date           = "2025-10-03T21:57:32Z" [90m-> null[0m[0m
      [31m-[0m[0m force_detach_policies = false [90m-> null[0m[0m
      [31m-[0m[0m id                    = "astro-data-pipeline-ebs-csi-driver-role" [90m-> null[0m[0m
      [31m-[0m[0m managed_policy_arns   = [] [90m-> null[0m[0m
      [31m-[0m[0m max_session_duration  = 3600 [90m-> null[0m[0m
      [31m-[0m[0m name                  = "astro-data-pipeline-ebs-csi-driver-role" [90m-> null[0m[0m
      [31m-[0m[0m path                  = "/" [90m-> null[0m[0m
      [31m-[0m[0m tags                  = {} [90m-> null[0m[0m
      [31m-[0m[0m tags_all              = {
          [31m-[0m[0m "Environment"        = "staging"
          [31m-[0m[0m "Layer"              = "04-compute"
          [31m-[0m[0m "ManagedBy"          = "terraform"
          [31m-[0m[0m "Owner"              = "pmcgee"
          [31m-[0m[0m "Project"            = "astro-data-pipeline"
          [31m-[0m[0m "TerraformWorkspace" = "staging"
          [31m-[0m[0m "Version"            = "0.1"
        } [90m-> null[0m[0m
      [31m-[0m[0m unique_id             = "AROAZ3MJRFMSJ6MFVQ4AO" [90m-> null[0m[0m
        [90m# (3 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 0 to add, 4 to change, 3 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m eks_cluster_version                    = "1.28" [33m->[0m[0m "1.30"
  [31m-[0m[0m eks_oidc_issuer_url                    = "https://oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9" [90m-> null[0m[0m
  [31m-[0m[0m eks_oidc_provider_arn                  = "arn:aws:iam::677282655012:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/84D63E34CF5F1A3EDA332F88485A32A9" [90m-> null[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named
[33m│[0m [0m"enable_horizontal_pod_autoscaler" but a value was found in file
[33m│[0m [0m"../staging.tfvars". If you meant to use this value, add a "variable" block
[33m│[0m [0mto the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "s3_buckets" but a value
[33m│[0m [0mwas found in file "../staging.tfvars". If you meant to use this value, add
[33m│[0m [0ma "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValues for undeclared variables[0m
[33m│[0m [0m
[33m│[0m [0m[0mIn addition to the other similar warnings shown, 25 other variable(s)
[33m│[0m [0mdefined without being declared.
[33m╵[0m[0m

```

</details>

*Pushed by: @p27mcgee, Action: `pull_request`*